[
    {
        "id" : 1,
        "title": "Harry Potter ve Felsefe Taşı",
        "director": "Chris Columbus",
        "year": "2001",
        "genre": "Fantastik",
        "description": "On bir yaşındaki Harry Potter, anne ve babasının bir büyücü olduğunu öğrenir ve Hogwarts Cadılık ve Büyücülük Okulu'na kabul edilir. Burada yeni arkadaşlıklar kurar ve ilk yıl maceralarında okulun derinliklerinde saklı olan gizemli Felsefe Taşı'nın sırrını keşfetmek zorunda kalır.",
        "imageUrl" : "assets/harry_potter.jpg"
    } ,
    {
        "id": 2,
        "title": "Yüzüklerin Efendisi: Yüzük Kardeşliği",
        "director": "Peter Jackson",
        "year": 2001,
        "genre" : "Fantastik", 
        "description": "Orta Dünya'yı karanlık efendi Sauron'un yıkımından kurtarmak için, Hobbit Frodo Baggins, Karanlık Lord'un gücünü taşıyan Tek Yüzük'ü yok etme görevini üstlenir. Ona yardım etmek ve yüzüğü Mordor'daki Hüküm Dağı'na ulaştırmak üzere sekiz yoldaştan oluşan Yüzük Kardeşliği kurulur.",
        "imageUrl" : "assets/yuzuklerin.jpg"
    },
    {
       "id": 3,
       "title": "Ayla",
       "director": "Can Ulkay",
       "year": 2017,
       "genre": "Dram",
       "description": "Kore Savaşı sırasında bir Türk tugayı askeri olan Astsubay Süleyman Dilbirliği'nin, kimsesiz ve annesi babası öldürülmüş Koreli küçük bir kız çocuğu bulmasıyla başlayan gerçek bir hikayeden uyarlanmıştır. Süleyman, Ayla adını verdiği kızı himayesine alır ve aralarında güçlü bir baba-kız bağı oluşur. Süleyman'ın Türkiye'ye dönmesi gerektiğinde, Ayla'yı bırakmak istememesi büyük bir ayrılık hikayesine neden olur.",
       "imageUrl": "assets/ayla.jpg"
    },
    {
    "id": 4,
    "title": "Esaretin Bedeli",
    "director": "Frank Darabont",
    "year": 1994,
    "genre": "Dram",
    "description": "Başarılı bir bankacı olan Andy Dufresne, karısını ve onun sevgilisini öldürmek suçundan iki kez müebbet hapis cezasına çarptırılır ve Shawshank Eyalet Hapishanesi'ne gönderilir. Film, Andy'nin parmaklıklar ardındaki acımasız hayata uyum sağlama mücadelesini, umudu ve yıllar süren gizli kaçış planını, dostu 'Red' ile kurduğu ilişki üzerinden anlatır.",
    "imageUrl": "assets/Esaretin Bedeli.jpg"
    },
    {
      "id": 5,
      "title": "Baba (The Godfather)",
      "director": "Francis Ford Coppola",
      "year": 1972,
      "genre": "Suç/Dram",
      "description": "New York'taki güçlü İtalyan-Amerikan Corleone suç ailesinin hikayesini merkezine alır. Ailenin reisi Vito Corleone, suikast girişimi sonrası gücü, savaşa karşı çıkan en küçük oğlu Michael Corleone'ye devretmek zorunda kalır. Michael, ailesini koruma uğruna giderek daha acımasız bir mafya babasına dönüşür.",
      "imageUrl": "assets/godfather.jpg"
    },
    {
      "id": 6,
      "title": "7. Koğuştaki Mucize",
      "director": "Mehmet Ada Öztekin",
      "year": 2019,
      "genre": "Dram",
      "description": "1983 yılında küçük bir Ege kasabasında yaşayan, zihinsel engelli Memo'nun (Aras Bulut İynemli), masum olmasına rağmen bir komutanın kızını öldürmekle suçlanarak idama mahkum edilmesini konu alır. Kızı Ova'dan ayrılmak zorunda kalan Memo'nun 7. koğuşta yaşadıkları ve masumiyetini kanıtlama çabası anlatılır.",
      "imageUrl": "assets/yedinci_kogus.jpg"
    },
    {
        "id": 7,
        "title": "Fight Club",
        "year": 1999,
        "director": "David Fincher",
        "genre": "Dram / Gizem",
        "description": "Kimliği belirsiz ve isimsiz bir anlatıcının (Edward Norton), tüketim toplumundan duyduğu rahatsızlık nedeniyle hayatından ve işinden bıkmasıyla başlayan hikayeyi konu alır. Bu huzursuzluk, Tyler Durden (Brad Pitt) adında karizmatik bir sabun satıcısıyla tanışması ve yeraltı dövüş kulüpleri kurmalarıyla birlikte, toplumsal normlara karşı yıkıcı bir isyana dönüşür.",
        "imageUrl": "assets/fight_club.jpg" 
    },
    {
        "id": 8,
        "title": "Matrix",
        "year": 1999,
        "director": "Lana Wachowski, Lilly Wachowski",
        "genre": "Bilim Kurgu / Aksiyon",
        "description": "Gündüzleri bilgisayar programcısı olan Thomas Anderson'ın, Morpheus adında gizemli bir hacker tarafından dünyamızın aslında Matrix adı verilen yapay bir simülasyon olduğu konusunda uyarılmasıyla başlar. Neo adını alan Thomas, gerçekliği sorgulayıp kırmızı hapı seçerek, makinelerle savaşan yeraltı direnişine katılır ve seçilmiş kişi (The One) olma yolculuğuna çıkar.",
        "imageUrl": "assets/matrix.jpg" 
    },
    {
    "id": 9,
    "title": "Titanik (Titanic)",
    "year": 1997,
    "director": "James Cameron",
    "genre": "Romantik / Dram",
    "description": "1912 yılında, dünyanın en büyük ve en lüks gemisi olan Titanik'in ilk ve son yolculuğu sırasında geçen destansı bir aşk hikayesini anlatır. Farklı sosyal sınıflardan gelen fakir ressam Jack Dawson ile zengin ve nişanlı genç kadın Rose DeWitt Bukater'in imkansız aşkı, geminin Kuzey Atlantik'te bir buzdağına çarpmasıyla yaşanan tarihi felaketle kesişir.",
    "imageUrl": "assets/titanic.jpg" 
    },
    {
        "id": 10,
        "title": "Prestij (The Prestige)",
        "year": 2006,
        "director": "Christopher Nolan",
        "genre": "Gizem / Dram",
        "description": "Londra'da iki rakip sihirbazın, birbirlerini alt etmek için saplantılı ve tehlikeli bir rekabete girmesiyle yaşanan gizemli olaylar zincirini konu alır. Her yeni numara, rakiplerini daha tehlikeli sonuçlara iter.",
        "imageUrl": "assets/prestij.jpg"
    },
    {
        "id": 11,
        "title": "Avatar",
        "year": 2009,
        "director": "James Cameron",
        "genre": "Bilim Kurgu / Aksiyon",
        "description": "Pandora gezegeninde nadir bir minerali ele geçirmek için gönderilen felçli denizci Jake Sully, genetik olarak yaratılmış Na'vi bedenini (Avatar) kullanarak yerli halkın arasına sızar. Ancak zamanla Pandora'nın kültürü ve doğası onu derinden etkiler.",
        "imageUrl": "assets/avatar.jpg"
    },
    {
        "id": 12,
        "title": "Ben Efsaneyim (I Am Legend)",
        "year": 2007,
        "director": "Francis Lawrence",
        "genre": "Bilim Kurgu / Korku",
        "description": "Korkunç bir virüsün insanlığı yok etmesinden sonra, New York'ta kalan tek bağışıklı insan olan bilim adamı Robert Neville'ın hayatta kalma ve virüsün çaresini bulma mücadelesini anlatır. Geceleri mutantlar tarafından avlanırken gündüzleri umut arar.",
        "imageUrl": "assets/ben_efsaneyim.jpg"
    },
    {
        "id": 13,
        "title": "Kara Şövalye (The Dark Knight)",
        "year": 2008,
        "director": "Christopher Nolan",
        "genre": "Aksiyon / Suç",
        "description": "Batman'in Gotham şehrini suçtan temizleme çabaları, şehri kaosa sürüklemeyi hedefleyen deha suçlu Joker'in ortaya çıkmasıyla tehlikeye girer. Film, Batman'in kahramanlık sınırlarını zorlayan ahlaki çatışmasını işler.",
        "imageUrl": "assets/kara_sovalye.jpg"
    },
    {
        "id": 14,
        "title": "Joker",
        "year": 2019,
        "director": "Todd Phillips",
        "genre": "Suç / Dram",
        "description": "Film, başarısız bir komedyen olan Arthur Fleck'in, Gotham'ın yoksulluk ve adaletsizlik ortamında yavaş yavaş akıl sağlığını yitirerek, şehrin sembolik kötüsü Joker'e dönüşme sürecini, psikolojik derinliğiyle ele alır.",
        "imageUrl": "assets/joker.jpg"
    },
    {
        "id": 15,
        "title": "Alacakaranlık (Twilight)",
        "year": 2008,
        "director": "Catherine Hardwicke",
        "genre": "Fantastik / Romantik",
        "description": "Sıradan bir genç kız olan Bella Swan'ın, gizemli ve yakışıklı Edward Cullen'ın aslında bir vampir olduğunu öğrenmesiyle başlayan yasak aşk hikayesini anlatır. Bu ilişki, hem Bella'nın hem de Edward'ın ailesinin hayatını tehlikeye atar.",
        "imageUrl": "assets/alacakaranlik.jpg"
    },
    {
        "id": 16,
        "title": "Karayip Korsanları: Siyah İnci'nin Laneti",
        "year": 2003,
        "director": "Gore Verbinski",
        "genre": "Aksiyon / Macera",
        "description": "Kaptan Jack Sparrow'un, lanetli Karayip Korsanları tarafından çalınan gemisi Siyah İnci'yi geri alma macerasını konu alır. Ona, güzel Elizabeth Swann'ı kurtarmak isteyen Will Turner eşlik eder.",
        "imageUrl": "assets/karayip_korsanlari.jpg"
    },
    {
        "id": 17,
        "title": "Piyanist (The Pianist)",
        "year": 2002,
        "director": "Roman Polanski",
        "genre": "Biyografi / Savaş",
        "description": "Polonyalı Yahudi piyanist Władysław Szpilman'ın, 2. Dünya Savaşı sırasında Varşova'nın Nazi işgali altındayken yaşadığı yıkımı ve hayatta kalma mücadelesini anlatan gerçek bir hikayeye dayanır.",
        "imageUrl": "assets/piyanist.jpg"
    },
    {
        "id": 18,
        "title": "Gladyatör (Gladiator)",
        "year": 2000,
        "director": "Ridley Scott",
        "genre": "Aksiyon / Dram",
        "description": "Roma İmparatorluğu'nun sadık generali Maximus Decimus Meridius, imparatorun kıskanç oğlu Commodus tarafından ihanete uğrar ve ailesini kaybeder. Bir köle olarak hayatta kalıp gladyatör olan Maximus'un tek amacı, intikam almaktır.",
        "imageUrl": "assets/gladyator.jpg"
    },
    {
        "id": 19,
        "title": "Hababam Sınıfı",
        "year": 1975,
        "director": "Ertem Eğilmez",
        "genre": "Komedi",
        "description": "Özel Çamlıca Lisesi'nde okuyan, ders çalışmaktan çok haylazlık yapmayı seven, lakaplarıyla ünlü bir grup öğrencinin (Hababam Sınıfı) okul hayatını ve tatlı çatışmalarını anlatan efsanevi Türk komedi klasiğidir.",
        "imageUrl": "assets/hababam_sinifi.jpg"
    },
    {
        "id": 20,
        "title": "Zindan Adası (Shutter Island)",
        "year": 2010,
        "director": "Martin Scorsese",
        "genre": "Gizem / Gerilim",
        "description": "ABD Federal Polis Mareşali Teddy Daniels ve ortağı Chuck Aule, akıl hastalarına ev sahipliği yapan Ashecliffe Hastanesi'nden kaçan bir hastanın gizemli kayboluşunu araştırmak için uzak bir ada olan Shutter Island'a gider. Ancak ada, gittikçe daha tuhaf ve kafa karıştırıcı hale gelir.",
        "imageUrl": "assets/zindan_adasi.jpg"
    },
    {
        "id": 21,
        "title": "Babam ve Oğlum",
        "year": 2005,
        "director": "Çağan Irmak",
        "genre": "Dram",
        "description": "12 Eylül darbesi sırasında Ege'deki köyünden ayrılmak zorunda kalan gazeteci Sadık ile küçük oğlu Deniz'in duygusal hikayesini anlatır. Sadık'ın hastalığı nedeniyle oğlunu yıllardır görüşmediği babasına bırakma mücadelesi izleyiciye aktarılır.",
        "imageUrl": "assets/babam_ve_oglum.jpg"
    },
    {
        "id": 22,
        "title": "Buz Devri (Ice Age)",
        "year": 2002,
        "director": "Chris Wedge, Carlos Saldanha",
        "genre": "Animasyon / Komedi",
        "description": "Buzul Çağı'nın başlangıcında, tembel bir Sid adlı mamut, huysuz bir Manny adlı mamut ve kurnaz Diego adlı kaplanın, kaybolmuş bir insan bebeği ailesine geri götürme macerasını anlatır. Bu sırada sincap Scrat fındık derdindedir.",
        "imageUrl": "assets/buz_devri.jpg"
    },
    {
        "id": 23,
        "title": "Shrek",
        "year": 2001,
        "director": "Andrew Adamson, Vicky Jenson",
        "genre": "Animasyon / Komedi",
        "description": "Yanında geveze bir eşekle birlikte yaşayan huysuz dev Shrek'in, sinir bozucu Lord Farquaad'ın emriyle güzel Prenses Fiona'yı ejderhanın elinden kurtarma görevini üstlenmesini konu alır. Masal klişeleriyle dalga geçen bir animasyon klasiğidir.",
        "imageUrl": "assets/shrek.jpg"
    },
    {
        "id": 24,
        "title": "Karmakarışık (Tangled)",
        "year": 2010,
        "director": "Nathan Greno, Byron Howard",
        "genre": "Animasyon / Müzikal",
        "description": "Dünyayı keşfetme hayali kuran, 20 metre uzunluğunda sihirli saçlara sahip Prenses Rapunzel'in hikayesini anlatır. Kulesinden kaçmasına yardım eden çekici hırsız Flynn Rider ile birlikte tehlikeli ve eğlenceli bir maceraya atılır.",
        "imageUrl": "assets/rapunzel.jpg"
    },
    {
        "id": 25,
        "title": "Karlar Ülkesi (Frozen)",
        "year": 2013,
        "director": "Chris Buck, Jennifer Lee",
        "genre": "Animasyon / Müzikal",
        "description": "Korkunç kar ve buz güçlerine sahip Kraliçe Elsa'nın yanlışlıkla krallığını sonsuz bir kışa mahkum etmesi üzerine, küçük kız kardeşi Anna'nın, ablasını bulup krallığı kurtarmak için tehlikeli bir yolculuğa çıkmasını konu alır.",
        "imageUrl": "assets/karlar_ulkesi.jpg"
    },
    {
        "id": 26,
        "title": "Hobbit: Beklenmedik Yolculuk",
        "year": 2012,
        "director": "Peter Jackson",
        "genre": "Fantastik / Macera",
        "description": "Bilbo Baggins'in, Büyücü Gandalf ve on üç cüceden oluşan bir grupla, Ejderha Smaug'un ele geçirdiği Yalnız Dağ'daki kayıp cüce krallığını geri almak için çıktığı destansı yolculuğu anlatır. Bu macera, Bilbo'yu Gollum'la karşılaştıracak ve Tek Yüzük'ü bulmasını sağlayacaktır.",
        "imageUrl": "assets/hobbit.jpg"
    },
    {
        "id": 27,
        "title": "Transformers",
        "year": 2007,
        "director": "Michael Bay",
        "genre": "Bilim Kurgu / Aksiyon",
        "description": "Milyonlarca yıl önce Cybertron gezegeninde başlayan iyi (Autobots) ve kötü (Decepticons) robot ırkları arasındaki savaşın Dünya'ya taşınmasını konu alır. Sam Witwicky adlı genç, bu savaşın ortasında kalır ve Autobot'lara dünyayı Decepticons'tan korumada yardım etmek zorundadır.",
        "imageUrl": "assets/transformers.jpg"
    },
    {
        "id": 28,
        "title": "Uyumsuz (Divergent)",
        "year": 2014,
        "director": "Neil Burger",
        "genre": "Bilim Kurgu / Aksiyon",
        "description": "Distopik bir gelecekte, insanlar yeteneklerine ve kişiliklerine göre beş farklı hizbe ayrılmıştır. Tris Prior'un, kendisini herhangi bir hizbe tam olarak ait kılamayan 'Uyumsuz' olduğunu keşfetmesiyle başlayan hayatta kalma ve sistemi sorgulama mücadelesini konu alır.",
        "imageUrl": "assets/uyumsuz.jpg" 
    }
]